In [1]:
import pandas as pd
import numpy as ny
import matplotlib.pyplot as plt
from sklearn import linear_model

In [2]:
df = pd.read_csv('Documents/hiring.csv')

In [3]:
df

  experience  test_score  interview_score(out of 10)  salary
0        NaN         8.0                           9   50000
1        NaN         8.0                           6   45000
2       five         6.0                           7   60000
3        two        10.0                          10   65000
4      seven         9.0                           6   70000
5      three         7.0                          10   62000
6        ten         NaN                           7   72000
7     eleven         7.0                           8   80000

In [4]:
df.experience.fillna('zero')

0      zero
1      zero
2      five
3       two
4     seven
5     three
6       ten
7    eleven
Name: experience, dtype: object

In [5]:
df.experience = df.experience.fillna('zero')

In [6]:
df

  experience  test_score  interview_score(out of 10)  salary
0       zero         8.0                           9   50000
1       zero         8.0                           6   45000
2       five         6.0                           7   60000
3        two        10.0                          10   65000
4      seven         9.0                           6   70000
5      three         7.0                          10   62000
6        ten         NaN                           7   72000
7     eleven         7.0                           8   80000

In [7]:
import math

In [8]:
df.test_score.median()

8.0

In [9]:
test_score = math.floor(df.test_score.median())

In [10]:
test_score

8

In [11]:
df.test_score = df.test_score.fillna(test_score)

In [12]:
df

  experience  test_score  interview_score(out of 10)  salary
0       zero         8.0                           9   50000
1       zero         8.0                           6   45000
2       five         6.0                           7   60000
3        two        10.0                          10   65000
4      seven         9.0                           6   70000
5      three         7.0                          10   62000
6        ten         8.0                           7   72000
7     eleven         7.0                           8   80000

In [13]:
from word2number import w2n

In [14]:
df.experience = df.experience.apply(w2n.word_to_num)

In [18]:
df

   experience  test_score  interview_score(out of 10)  salary
0           0         8.0                           9   50000
1           0         8.0                           6   45000
2           5         6.0                           7   60000
3           2        10.0                          10   65000
4           7         9.0                           6   70000
5           3         7.0                          10   62000
6          10         8.0                           7   72000
7          11         7.0                           8   80000

In [15]:
# data preprocessing is over

In [16]:
reg = linear_model.LinearRegression()

In [17]:
# use reg.fit to train data
#reg.fit(df([['independent variables']], df.target variable))

reg.fit(df[['experience','test_score','interview_score(out of 10)']],df.salary)

LinearRegression()

In [19]:
reg.predict([[2,9,6]])

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([53205.96797671])

In [20]:
reg.predict([[12,10,10]])

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([92002.18340611])